WHU-EIS-Robotics/MSPM0-DevKit/UART/Driver/ti/driverlib/dl_rtc.h
/**
 *  @brief      Clear pending RTC interrupts
 *
 *  @param[in]  rtc    Pointer to the register overlay for the RTC peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_RTC_INTERRUPT
 */
__STATIC_INLINE void DL_RTC_clearInterruptStatus(
    RTC_Regs *rtc, uint32_t interruptMask)
{
    rtc->INT_EVENT0.ICLR = interruptMask;
}

/**
 *  @brief      Enable RTC event
 *
 *  @param[in]  rtc         Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to enable. Bitwise OR of
 *                          @ref DL_RTC_EVENT.
 */
__STATIC_INLINE void DL_RTC_enableEvent(RTC_Regs *rtc, uint32_t eventMask)
{
    rtc->INT_EVENT1.IMASK |= (eventMask);
}

/**
 *  @brief      Disable RTC event
 *
 *  @param[in]  rtc         Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to enable. Bitwise OR of
 *                          @ref DL_RTC_EVENT.
 */
__STATIC_INLINE void DL_RTC_disableEvent(RTC_Regs *rtc, uint32_t eventMask)
{
    rtc->INT_EVENT1.IMASK &= ~(eventMask);
}

/**
 *  @brief      Check which RTC events are enabled
 *
 *  @param[in]  rtc         Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to check. Bitwise OR of
 *                          @ref DL_RTC_EVENT.
 *
 *  @return     Which of the requested RTC interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_RTC_EVENT values
 */
__STATIC_INLINE uint32_t DL_RTC_getEnabledEvents(
    RTC_Regs *rtc, uint32_t eventMask)
{
    return ((rtc->INT_EVENT1.IMASK) & (eventMask));
}

/**
 *  @brief      Check event flag of enabled RTC event
 *
 *  Checks if any of the RTC events that were previously enabled are
 *  pending.
 *
 *  @param[in]  rtc         Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to check. Bitwise OR of
 *                          @ref DL_RTC_EVENT.
 *
 *  @return     Which of the requested RTC interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_RTC_EVENT values
 *
 *  @sa         DL_RTC_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_RTC_getEnabledEventStatus(
    RTC_Regs *rtc, uint32_t eventMask)
{
    return ((rtc->INT_EVENT1.MIS) & eventMask);
}

/**
 *  @brief      Check interrupt flag of any RTC event
 *
 *  Checks if any events are pending. Events do not have to
 *  be previously enabled.
 *
 *  @param[in]  rtc         Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to check. Bitwise OR of
 *                          @ref DL_RTC_EVENT.
 *
 *  @return     Which of the requested RTC interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_RTC_EVENT values
 */
__STATIC_INLINE uint32_t DL_RTC_getRawEventsStatus(
    RTC_Regs *rtc, uint32_t eventMask)
{
    return ((rtc->INT_EVENT1.RIS) & eventMask);
}

/**
 *  @brief      Clear pending RTC events
 *
 *  @param[in]  rtc         Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to clear. Bitwise OR of
 *                          @ref DL_RTC_EVENT.
 */
__STATIC_INLINE void DL_RTC_clearEventsStatus(
    RTC_Regs *rtc, uint32_t eventMask)
{
    rtc->INT_EVENT1.ICLR |= (eventMask);
}

/**
 *  @brief Sets the event publisher channel ID
 *
 *  @param[in]  rtc     Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      publisher is disconnected.
 */
__STATIC_INLINE void DL_RTC_setPublisherChanID(RTC_Regs *rtc, uint8_t chanID)
{
    rtc->FPUB_0 = (chanID & RTC_FPUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel ID
 *
 *  @param[in]  rtc Pointer to the register overlay for the
 *                  peripheral
 *
 *  @return     Event publisher channel ID
 *
 */
__STATIC_INLINE uint8_t DL_RTC_getPublisherChanID(RTC_Regs *rtc)
{
    return (uint8_t)(rtc->FPUB_0 & RTC_FPUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief      Initializes the settings to operate the RTC in Calendar mode.
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *  @param[in]  calendarTime        Structure containing the values for the
 *                                  Calendar to be initialized to
 *  @param[in]  formatSelect        Selectable format the RTC peripheral will
 *                                  provide time in.
 *                                  @ref DL_RTC_FORMAT
 *
 */
extern void DL_RTC_initCalendar(
    RTC_Regs *rtc, DL_RTC_Calendar calendarTime, DL_RTC_FORMAT formatSelect);

/**
 *  @brief      Returns the Calendar Time
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *
 * This function returns the current Calendar Time in the form of a Calendar
 * structure.
 * The time returned will be in the previously selected format.
 *
 *  @return            A Calendar structure containing the current time.
 *
 */
extern DL_RTC_Calendar DL_RTC_getCalendarTime(RTC_Regs *rtc);

/**
 *  @brief      Set calendar alarm 1
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *  @param[in]  alarmTime           Structure containing the values for the
 *                                  alarm to be set to
 *
 */
extern void DL_RTC_setCalendarAlarm1(
    RTC_Regs *rtc, DL_RTC_CalendarAlarm alarmTime);

/**
 *  @brief      Get calendar alarm 1
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *
 *  @return     A Alarm structure containing the set time for alarm 1
 *
 */
extern DL_RTC_CalendarAlarm DL_RTC_getCalendarAlarm1(RTC_Regs *rtc);

/**
 *  @brief      Enable calendar alarm 1
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *
 */
extern void DL_RTC_enableCalendarAlarm1(RTC_Regs *rtc);

/**
 *  @brief      Disable calendar alarm 1
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *
 */
extern void DL_RTC_disableCalendarAlarm1(RTC_Regs *rtc);

/**
 *  @brief      Set calendar alarm 2
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *  @param[in]  alarmTime           Structure containing the values for the
 *                                  alarm to be set to
 *
 */
extern void DL_RTC_setCalendarAlarm2(
    RTC_Regs *rtc, DL_RTC_CalendarAlarm alarmTime);

/**
 *  @brief      Get calendar alarm 2
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *
 *  @return     A Alarm structure containing the set time for alarm 2
 *
 */
extern DL_RTC_CalendarAlarm DL_RTC_getCalendarAlarm2(RTC_Regs *rtc);

/**
 *  @brief      Enable calendar alarm 2
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *
 */
extern void DL_RTC_enableCalendarAlarm2(RTC_Regs *rtc);

/**
 *  @brief      Disable calendar alarm 2
 *
 *  @param[in]  rtc                 Pointer to the register overlay for the
 *                                  RTC peripheral
 *
 */
extern void DL_RTC_disableCalendarAlarm2(RTC_Regs *rtc);

#ifdef __cplusplus
}
#endif
#endif /* __MSPM0_HAS_RTC__ */

#endif /* ti_dl_dl_rtc__include */
/** @}*/
